In [2]:
from pandas import Series
series1 = Series([1, 2, 3, 4, 5])
series2 = Series([100, 200, 300, 400, 500, 600])
series1 + series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [4]:
from pandas import DataFrame
data1 =  {'Speed':[100, 103, 105],
           'Temp':[34, 23, 42]}
frame1 = DataFrame(data1)
frame1

   Speed  Temp
0    100    34
1    103    23
2    105    42

In [5]:
data2 =  {'Speed':[101, 109, 106],
           'Temp':[34, 23, 42],
           'Humidity':[45, 23, 58]
         }
frame2 = DataFrame(data2)
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [6]:
frame1 + frame2

   Humidity  Speed  Temp
0       NaN    201    68
1       NaN    212    46
2       NaN    211    84

In [7]:
series2 = Series([100, 200, 300], index=['Speed', 'Temp', 'Humidity'])
series2

Speed       100
Temp        200
Humidity    300
dtype: int64

In [8]:
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [9]:
frame2 - series2

   Speed  Temp  Humidity
0      1  -166      -255
1      9  -177      -277
2      6  -158      -242

In [10]:
series3 = Series([100, 200], index=['Speed', 'Temp'])
series3

Speed    100
Temp     200
dtype: int64

In [11]:
frame2 - series3

   Humidity  Speed   Temp
0       NaN    1.0 -166.0
1       NaN    9.0 -177.0
2       NaN    6.0 -158.0

In [12]:
ser = Series([3, 7, 1, 4, 7, 2], index=[2, 7, 3, 5, 9, 1])
ser

2    3
7    7
3    1
5    4
9    7
1    2
dtype: int64

In [17]:
ser.sort_index()

1    2
2    3
3    1
5    4
7    7
9    7
dtype: int64

In [18]:
data2 =  {'Speed':[101, 109, 106],
           'Temp':[34, 23, 42],
           'Humidity':[45, 23, 58]
         }
frame2 = DataFrame(data2)
frame2

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [19]:
frame2 = frame2.reindex([2, 1, 0])
frame2

   Speed  Temp  Humidity
2    106    42        58
1    109    23        23
0    101    34        45

In [20]:
frame2.sort_index()

   Speed  Temp  Humidity
0    101    34        45
1    109    23        23
2    106    42        58

In [22]:
frame2 = frame2.reindex(columns=['Speed', 'Humidity', 'Temp'])
frame2

   Speed  Humidity  Temp
2    106        58    42
1    109        23    23
0    101        45    34

In [24]:
frame2.sort_index(axis=1, ascending=False)

   Temp  Speed  Humidity
2    42    106        58
1    23    109        23
0    34    101        45

In [25]:
series2 = Series([100, 200, 300], index=['Speed', 'Temp', 'Humidity'])
series2

Speed       100
Temp        200
Humidity    300
dtype: int64

In [26]:
series2.sort_values()

Speed       100
Temp        200
Humidity    300
dtype: int64

In [27]:
 frame2

   Speed  Humidity  Temp
2    106        58    42
1    109        23    23
0    101        45    34

In [28]:
frame2.sort_values(by='Humidity')

   Speed  Humidity  Temp
1    109        23    23
0    101        45    34
2    106        58    42

In [29]:
series = Series([100, 200, 300], index=['a', 'b', 'a'])
series

a    100
b    200
a    300
dtype: int64

In [30]:
series.index.is_unique

False

In [31]:
frame2.sum()

Speed       316
Humidity    126
Temp         99
dtype: int64

In [32]:
frame2

   Speed  Humidity  Temp
2    106        58    42
1    109        23    23
0    101        45    34

In [33]:
frame2.sum()

Speed       316
Humidity    126
Temp         99
dtype: int64

In [34]:
frame2.sum(axis=1)

2    206
1    155
0    180
dtype: int64

In [35]:
frame2.idxmax()

Speed       1
Humidity    2
Temp        2
dtype: int64

In [36]:
import numpy as np
ser = Series([1, 2, 3, 4, np.nan], index=['a', 'b', 'c', 'd', 'e'])
ser

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [37]:
ser.dropna()

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [38]:
data2 =  {'Speed':[101, np.nan, 106],
           'Temp':[34, 23, 42],
           'Humidity':[45, np.nan, 58]
         }
frame2 = DataFrame(data2)
frame2

   Speed  Temp  Humidity
0  101.0    34      45.0
1    NaN    23       NaN
2  106.0    42      58.0

In [39]:
frame2.dropna()

   Speed  Temp  Humidity
0  101.0    34      45.0
2  106.0    42      58.0

In [40]:
frame2.fillna(0)

   Speed  Temp  Humidity
0  101.0    34      45.0
1    0.0    23       0.0
2  106.0    42      58.0